"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict
"""

list_mon = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
duct_mon = {1 : "зима", 2 : "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето",
            7: "лето", 8: "лето", 9:"осень", 10:"осень", 11:"осень", 12:"зима"}

input_value = None

while (input_value is None or not input_value.isdigit()):
    if not input_value is None:
        print("Введено не целое число, попробуйте еще раз")

    input_value = input("Введите число номер месяца: ")

print(f"Время года по списку: {list_mon[int(input_value)-1]}")
print(f"Время года по словарю: {duct_mon[int(input_value)]}")
